import React from "react";
import translate from "../../i18n/translate";
import TaskList from "../../components/ManagerTask/TaskList";

const Home = () => {
  const list = [
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
    {
      header: 'Діма Овсієнко',
      body: 'Я б хотів отримати розгорнуту інформацію по Вашому новому проекту "MARKSEM House-Bath". Дуже цікавить з якого матеріалу виробляєте бані, які сроки...',
      url: '',
      colorButton: '#00d0ff'
    },
  ];

  return (
    <div>
      <h1>{translate('home')} </h1>

      <TaskList taskList={list}/>
    </div>
  );

};

export default Home;
